app/controllers/roads_controller.rb

  def index
    @roads = Road.all
---
SELECT "roads".* FROM "roads"

  def changerFormuleExecute
    id = params[:idroute]
    formule = params[:nformule]
    Road.where(idroute: id).update_all(formule: formule)
---
SELECT "roads".* FROM "roads" WHERE "roads"."idroute" = $1 LIMIT $2  [["idroute", 1], ["LIMIT", 1]]
UPDATE "roads" SET "formule" = $1 WHERE "roads"."idroute" = $2  [["formule", "fdsfsdfsdfdsf"], ["idroute", 1]]