app/models/road.rb

SELECT "roads".* FROM "roads"
---
  def fetchFormule(connection)
    #routes = self.getAllRoads(connection)
    routes = Road.all
    for r in routes
      if self.formule.include?(r.nom)